Revit 2024 API
MEPBuildingConstructionSet.Clear Method
Removes every MEPBuildingConstruction from the set, rendering it empty.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Clear()
Visual Basic
Public Overridable Sub Clear
Visual C++
public:
virtual void Clear()
See Also
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace